app/Models/HomeModel.php

SELECT *
FROM `users`
WHERE `user_name` = 'testUser1'
OR `user_email` = 'testUser1'
---
    public function getUserCredentials($username,$password){

        $builder = $this->db->table('users')
                    ->where('user_name', $username)
                    ->orWhere('user_email', $username);
        $user = $builder->get()->getRowArray();

SELECT *
FROM `users`
WHERE `user_id` = '4'
---
    public function getUserDataById($id){

        $builder = $this->db->table('users')
                    ->where('user_id',$id)
                    ->get()->getRowArray();